trade_exp/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Сотрудники</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b57ce5b7-9e28-4f84-a668-467a507068c3">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="613a9982-ea2e-40bd-b0e1-5642e976be87">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c97fb60c-ec2d-420a-93a9-39602a2bbfdf">
    <name>Уволен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18560314-7951-472c-8aac-2a5b52d0acfe">
    <name>Отдел</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf0376ac-0d78-4ccb-88b0-6fb290797677">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa27d4c3-5c6c-4d49-bc20-f0d9faedd48f">
    <name>РольОПШ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f20e46f-464f-4f7c-85f2-c2ceb761c7ca">
    <name>ДатаУвольнения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea584be0-70fa-40c6-9056-0ac6d48f5544">
    <name>ДатаПриема</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="93190e85-82b5-4f8d-86d4-60a3ed158497">
    <name>ИзменятьТребуетПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ae0a6a00-9b29-4553-88a2-43a85bee5a3a">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c716114-b753-459f-820d-3eefc10412b6">
    <name>ИдентификаторМобильногоПриложения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0e3a882-dc26-453d-ae18-394afecbe606">
    <name>ЦельПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e140be66-a953-4235-9404-eb1e4326c329">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e204e166-c00a-4107-b2f6-e178a0260ea2">
    <name>ПотребностьВСлужебномТранспорте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e321359-c912-4451-9965-e660dd87561c">
    <name>ВГрафике</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="75ed98aa-60db-49f8-9e60-419549eea6b0">
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="81ba44aa-675f-4a78-bd9e-bd949a5d139f">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c56826a-54b5-44f6-b674-4f57e9006ae4">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c365c143-4ee2-4da0-840a-f5707c956f21">
    <name>ИзменятьЦель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1bad7ab2-c198-4c43-a6cd-a4c4dcb497cf">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="824f90f8-db60-4eee-ae25-c8da8bd31141">
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="46ca7a78-d4ae-44ee-8d05-a15add9f79c4">
    <name>ПутьДляФотоСТСД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7b035ccb-950d-48ec-ba42-fbcf94fe0d51">
    <name>УстанавливатьПериодНеПозднее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7162254b-c2fe-4139-94ea-cc0f720a9b3d">
    <name>ИзменятьТипПропуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="961c74cb-fce1-43c3-af7f-b67d404817cb">
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6667f724-4527-4af9-9d26-f2ced65f4ed5">
    <name>ВыгружатьНаСайт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e43fec11-e2d6-4ba1-935e-cfc4047484d6">
    <name>Индивидуально</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="35688e1d-3d5d-4ba4-a2d2-a8ae02028ceb">
    <name>УровеньДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9dfb1156-61b0-4cf6-a749-49cf491b66af">
    <name>ЗапретитьСоздаватьПропуск</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="662ef78d-bb7a-4142-8543-46c55d375e3a">
    <name>ИзменятьПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0983b722-4b9b-4508-9502-eadb41d5ef36">
    <name>ТабельныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="25fb4b64-3389-40d8-a0fb-1a48696c5f69">
    <name>ДатаПеревода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="de354010-7d67-44cf-87d4-e48af516a477">
    <name>РольМобильногоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6020fb7b-5fb1-4cf3-a1df-ee412178682d">
    <name>ДолжностьЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="44079ee7-c820-4e7e-90b6-b558be1c261a">
    <name>ПодразделениеЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ae05a309-265f-484f-b720-0b93517910b0">
    <name>ОповещенияИзОчереди</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d6189b4-cd43-4428-b345-8c04fb2cba4c">
    <name>ВышестоящееПодразделениеЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="df0fd9e1-cd5c-4ecd-9102-493f1dbba937">
    <name>ВнутреннийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41e900a7-c10f-4f56-bc62-69d7108bc92e">
    <name>КорпоративныйТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1973c897-b5f8-4020-b1e7-47881040abeb">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0fdb6ac0-b230-43d6-b6e7-bd153e64f5a0">
    <name>Удаленщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fb666be-2e07-4d2e-8843-dcec84180a27">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d44aa133-8703-4fc0-b5ff-67b13c6f1ea4">
    <name>ДопУтверждениеББ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57989287-32be-4a51-8f5a-0c9a27b45041">
    <name>ПравоНаПроверку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0150eb34-5757-4b0a-b42e-18cb40c1f263">
    <name>ПравоНаСогласование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba7e389d-4b02-43cb-9a13-1b3a0f9a4be1">
    <name>Аутсорс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="de79966c-ad14-441f-95c9-e94a04bef8bc">
    <name>СписокЗон</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a6561ebb-def2-4423-834a-41631f1b243a">
      <name>ЗонаДоступа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="aff5c93c-abdd-44ce-86ba-3df5ea78303d">
    <name>РабочиеУчастки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e6045355-ff14-41a0-a6e6-dba35c5249a7">
      <name>РабочийУчасток</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e6b14f6a-ed6b-424d-92dd-c34e7f8b22e6">
    <name>БейджыВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d1e828b1-f591-4c25-9e7e-aeef3e67afb2">
      <name>ТранспортноеСредство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="806f21ff-78a2-4496-90c9-dfd5253a5be0">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>15</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="69aeacfc-4a6b-4d95-9201-ae704bbb53c0">
      <name>Наименование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>60</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Enums/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="97a5f1f4-6332-4100-9848-6c0907797835">
  <name>ОтветственныеЛицаОрганизаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="6149f789-afe7-422c-a493-7ed022301a1f">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b684c73e-a0ee-430e-b257-6a45d3bfa9e8">
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7051be52-085c-4f1d-8771-884f940665d9">
    <name>РуководительКадровойСлужбы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7c5ff123-a776-47df-86fc-cf4b1ec58a98">
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="67abba6a-4282-4992-9618-279544beb35c">
    <name>ОтветственныйЗаБухгалтерскиеРегистры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8b3885ee-33d0-4703-8117-7c1f13a3d806">
    <name>ОтветственныйЗаНалоговыеРегистры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="447532e6-a3c2-4b64-a14c-d5085a6df77d">
    <name>УполномоченныйПредставитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="84867bf4-7a25-4dab-b127-224d03599ea1">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3f3629fc-a4ec-472f-891a-5ff5b593ea06">
    <name>ОтветственныйЗаВУР</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Перем ЗакрытьБезВопроса;

&НаКлиенте
Перем МодифицированностьФормыДляЗакрытия;

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодифицированностьОбъекта = ЭтаФорма.Модифицированность ИЛИ ?(МодифицированностьФормыДляЗакрытия = Неопределено, Ложь, МодифицированностьФормыДляЗакрытия);
	Если МодифицированностьОбъекта и ЗакрытьБезВопроса = Неопределено И Не ЗначениеЗаполнено(Объект.Пользователь) Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаЗаполнитеСотруднка", ЭтаФорма, );
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение,
		"Некоторые процессы 1С (создание задач в Битрикс, ордеров...) используют привязку Сотрудник - Пользователь. В случае, если это поле не заполнено, 1С выдает различные ошибки",
		Режим,
		,
		,
		"Закрыть, не заполнив пользователя сотрудника?");
		МодифицированностьФормыДляЗакрытия = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаЗаполнитеСотруднка(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Пользователь;
	Иначе
		ЗакрытьБезВопроса = Истина;
        Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	МодифицированностьФормыДляЗакрытия = ЭтаФорма.Модифицированность;
	
	Если МодифицированностьФормыДляЗакрытия И Не ЗначениеЗаполнено(Объект.Пользователь) Тогда
		Сообщить("Заполните, пожалуйста, пользователя сотрудника, если это возможно!");
		ЭтаФорма.ТекущийЭлемент = Элементы.Пользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Элементы.Код.ТолькоПросмотр = Не РольДоступна("ПолныеПрава");
	
	//Фотография
	СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(Объект.Ссылка.Фотография.Получить());
	Картинка=  СсылкаНаДвоичныеДанныеФайла;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	НадписьПароль = Объект.Пароль;
	
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.ИдентификаторМобильногоПриложения.Доступность = Истина;
	КонецЕсли;
	
	Если РольДоступна("АдминистрированиеПропускнойСистемы") ИЛИ РольДоступна("ПолныеПрава") Тогда
		Элементы.СКУД.Видимость = Истина;
		Элементы.ГруппаИндивидуально.Доступность = Объект.Индивидуально;
	КонецЕсли;
	
	Если НЕ(РольДоступна("ПечатьБейджика") ИЛИ РольДоступна("ПолныеПрава") ИЛИ РольДоступна("АдминистрированиеПропускнойСистемы")) Тогда
		Элементы.ПодменюПечатьОбычное_МакетШтрихкода.Видимость = Ложь;
	КонецЕсли;
	Элементы.Уволен.ТолькоПросмотр=значениезаполнено(Объект.ТабельныйНомер);
	Элементы.ДатаУвольнения.ТолькоПросмотр=значениезаполнено(Объект.ТабельныйНомер);
	Элементы.ДатаПриема.ТолькоПросмотр=значениезаполнено(Объект.ТабельныйНомер);
	
	Элементы.ГруппаУтверждениеБонусныхБаллов.Видимость = (Объект.ДопУтверждениеББ = Истина Или Объект.Должность.УтверждениеББ = Истина); 
    Элементы.ДопУтверждениеББ.ТолькоПросмотр = Не ДопМодуль.РольДоступнаОтделАналитики();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПартнерПриИзменении(Неопределено);
	ОтображениеБейджейВодителя();
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	Объект.Наименование = Объект.Пользователь;
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	Объект.Наименование = Объект.ФизическоеЛицо;
КонецПроцедуры

&НаКлиенте
Процедура ИндивидуальноПриИзменении(Элемент)
	Элементы.ГруппаИндивидуально.Доступность = Объект.Индивидуально;
КонецПроцедуры

//Фотографии
&НаКлиенте
Процедура ДобавитьФотографию(Команда)
	АдресХранилища= "";
	ВыбранноеИмяФайла="";
	Если ПоместитьФайл (АдресХранилища,,ВыбранноеИмяФайла,Истина) Тогда
		ДанныеФото= Новый ДвоичныеДанные(ВыбранноеИмяФайла);
		АдресФотографии= ПоместитьВоВременноеХранилище(ДанныеФото, УникальныйИдентификатор);
		
		Картинка=  АдресФотографии;
		
		УстановитьФотографиюСервер(АдресФотографии);
		ЭтаФорма.Прочитать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФотографию(Команда)
	Картинка=  Неопределено;
	
	УдалитьФотографиюСервер();
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаСервере
Процедура УстановитьФотографиюСервер(АдресФотографии)
	ОБ= РеквизитФормыВЗначение("Объект");
	ОБ.УстановитьФотографию(АдресФотографии);
КонецПроцедуры

&НаСервере
Процедура УдалитьФотографиюСервер()
	ОБ= РеквизитФормыВЗначение("Объект");
	ОБ.УдалитьФотографию();
	КонецПроцедуры

//-


// СтандартныеПодсистемы.ПодключаемыеКоманды Не работает
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

//&НаКлиенте
//Процедура ТелефонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка= Ложь;
//	
//	Оповещение= Новый ОписаниеОповещения("ВыборТелефонаЗавершение", ЭтаФорма);
//	ПараметрыФормы= Новый Структура;
//	ПараметрыФормы.Вставить("ВидКонтактнойИнформации", п
//	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводТелефона", ПараметрыФормы, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//КонецПроцедуры
&НаКлиенте
Процедура ВыборТелефонаЗавершение(Результат, ДопПараметры) Экспорт
	Объект.Телефон= Результат;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПутьДляФото(Команда)
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
Если Диалог.Выбрать() Тогда
Объект.ПутьДляФотоСТСД = Диалог.Каталог;
//Полный путь к каталогу помещен в переменную ИмяКаталога
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		Элементы.ДатаУвольнения1.Доступность= Истина;
		Элементы.Уволен1.Доступность= Истина;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ПустаяСтрока(ПарольФорма) Тогда
		//md5
		
		//ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
		//ХешированиеДанных.Добавить(ПарольФорма);
		//ХешСумма = СтрЗаменить(Строка(ХешированиеДанных.ХешСумма), " ", "");
		
		//Base64
		ХешСумма= АльтерраОбщегоНазначения.КодироватьВBase64(ПарольФорма);
		
		ТекущийОбъект.Пароль= ХешСумма;
	КонецЕсли;
	
	Телефон = Объект.Телефон;
	ЕстьСотрудникСТакимНомером = ЕстьСотрудникСТакимНомеромТелефона(Телефон, Объект.Ссылка);
	Если ЕстьСотрудникСТакимНомером <> Неопределено Тогда
		Сообщить("Сотрудник с номером телефона " + Телефон + " уже есть в базе: " + ЕстьСотрудникСТакимНомером + ". ");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Функция ЕстьСотрудникСТакимНомеромТелефона(НомерТелефона, Сотрудник) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Телефон КАК Телефон,
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Телефон = &НомерТелефона
	|	И Сотрудники.Ссылка <> &Сотрудник";
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой()Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Выборка.Телефон <> "" Тогда
			СотрудникСТакимНомером = Выборка.Ссылка;	
			Возврат СотрудникСТакимНомером;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции

// Печать: Договор, Доверенность
&НаКлиенте
Процедура Договор(Команда)
	ПоказатьДокументMSWord("Договор");
КонецПроцедуры

&НаКлиенте
Процедура Доверенность(Команда)
	ПоказатьДокументMSWord("Доверенность");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДокументMSWord(ИмяМакета)
	Сотрудник = Объект.Ссылка;
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ДанныеДляПечати = ПолучитьДанныеПоДокументуИДоговоруWord(Сотрудник);
		
		Макет = ПолучитьМакетСервер(ИмяМакета);
		
		ВремФайл = ПолучитьИмяВременногоФайла("doc");
		Ворд = УправлениеПечатьюMSWordКлиент.ПолучитьМакетMSWord(Макет, ВремФайл);
		ActiveDocument = Ворд.COMСоединение.ActiveDocument;
		
		Для Каждого стрДанные Из ДанныеДляПечати Цикл
			АльтерраОбщегоНазначенияКлиент.ЗаменитьВWord(ActiveDocument, стрДанные.Ключ, стрДанные.Значение);
		КонецЦикла;
		
		УправлениеПечатьюMSWordКлиент.ПоказатьДокументMSWord(Ворд);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетСервер(ИмяМакета)
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоДокументуИДоговоруWord(Сотрудник)	
	Данные = ИнициализацияСтруктуры();
	
	Запрос = Новый Запрос;
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.ФизическоеЛицо) КАК ФизическоеЛицоПредставление,
		|	ФизическиеЛица.ДатаРождения КАК ДатаРожденияФизЛица,
		|	ДокументыФизическихЛиц.Серия КАК ФизЛицоСерия,
		|	ДокументыФизическихЛиц.Номер КАК ФизЛицоНомер,
		|	ДокументыФизическихЛиц.ДатаВыдачи КАК ФизЛицоДатаВыдачи,
		|	ДокументыФизическихЛиц.КемВыдан КАК ФизЛицоКемВыдан,
		|	ДокументыФизическихЛиц.КодПодразделения КАК ФизЛицоКодПодразделения,
		|	Партнеры.НаименованиеПолное КАК ПартнерНаименованиеПолное,
		|	ПРЕДСТАВЛЕНИЕ(Партнеры.Ссылка) КАК ПартнерПредставление,
		|	Контрагенты.Ссылка КАК Контрагент,
		|	Контрагенты.ИНН КАК ИННКонтрагенты,
		|	Сотрудники.Организация КАК Организация,
		|	Организации.Наименование КАК РабочееНаименованиеОрганизации,
		|	Организации.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
		|	Организации.НаименованиеСокращенное КАК СокращенноеНаименованиеОрганизации,
		|	Организации.ИНН КАК ИННОрганизации,
		|	Организации.КПП КАК КППОрганизации,
		|	Организации.ОГРН КАК ОГРНОрганизации,
		|	ФизЛицоПартнера.Ссылка КАК ФизЛицоПартнера,
		|	ПРЕДСТАВЛЕНИЕ(ФизЛицоПартнера.Ссылка) КАК ФизЛицоПартнераПредставление,
		|	ФизЛицоПартнера.ДатаРождения КАК ФизЛицоПартнераДатаРождения,
		|	ФизЛицоПартнераДокументы.Серия КАК ФизЛицоПартнераСерия,
		|	ФизЛицоПартнераДокументы.Номер КАК ФизЛицоПартнераНомер,
		|	ФизЛицоПартнераДокументы.ДатаВыдачи КАК ФизЛицоПартнераДатаВыдачи,
		|	ФизЛицоПартнераДокументы.КемВыдан КАК ФизЛицоПартнераКемВыдан,
		|	ФизЛицоПартнераДокументы.КодПодразделения КАК ФизЛицоПартнераКодПодразделения,
		|	КонтрагентыДополнительныеРеквизиты.Значение КАК ОГРН,
		|	ПРЕДСТАВЛЕНИЕ(БанковскиеСчетаОрганизаций.Банк) КАК НаименованиеОсновногоБанковскогоСчета,
		|	БанковскиеСчетаОрганизаций.Банк.Город КАК НаименованиеОсновногоБанковскогоСчетаГород,
		|	БанковскиеСчетаОрганизаций.НомерСчета КАК РасчетныйСчет,
		|	БанковскиеСчетаОрганизаций.Банк.КоррСчет КАК КоррСчет,
		|	БанковскиеСчетаОрганизаций.Банк.Код КАК БИК
		|ПОМЕСТИТЬ ВТОсновная
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
		|				ПО Контрагенты.Ссылка = КонтрагентыДополнительныеРеквизиты.Ссылка
		|					И (КонтрагентыДополнительныеРеквизиты.Свойство.Заголовок = ""ОГРН"")
		|			ПО Партнеры.Ссылка = Контрагенты.Партнер
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизЛицоПартнера
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ФизЛицоПартнераДокументы
		|				ПО ФизЛицоПартнера.Ссылка = ФизЛицоПартнераДокументы.Физлицо
		|					И (ФизЛицоПартнераДокументы.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ))
		|			ПО (Партнеры.Наименование = ФизЛицоПартнера.Наименование + "" ИП""
		|					ИЛИ Партнеры.Наименование = ""ИП "" + ФизЛицоПартнера.Наименование
		|					ИЛИ Партнеры.Наименование = ФизЛицоПартнера.Наименование)
		|		ПО Сотрудники.Партнер = Партнеры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
		|			ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчетаОрганизаций.Ссылка
		|		ПО Сотрудники.Организация = Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|			ПО ФизическиеЛица.Ссылка = ДокументыФизическихЛиц.Физлицо
		|				И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ))
		|		ПО Сотрудники.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид,
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
		|ПОМЕСТИТЬ ВТФизическиеЛицаКонтактнаяИнформация
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТОсновная.ФизическоеЛицо
		|			ИЗ
		|				ВТОсновная)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОрганизацииКонтактнаяИнформация.Вид КАК Вид,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
		|ПОМЕСТИТЬ ВТОрганизацииКонтактнаяИнформация
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТОсновная.Организация
		|			ИЗ
		|				ВТОсновная)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	ВТФизическиеЛицаКонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Представление <> """"
		|	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	ВТФизическиеЛицаКонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Представление <> """"
		|	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	ВТФизическиеЛицаКонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Представление <> """"
		|	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	ВТОрганизацииКонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Представление <> """"
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксОрганизации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	ВТОрганизацииКонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Представление <> """"
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	ВТОрганизацииКонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Представление <> """"
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	ВТОрганизацииКонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Представление <> """"
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтрагентыКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТОсновная.Контрагент
		|			ИЗ
		|				ВТОсновная)
		|	И КонтрагентыКонтактнаяИнформация.Представление <> """"
		|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТОсновная.ФизЛицоПартнера
		|			ИЗ
		|				ВТОсновная)
		|	И ФизическиеЛицаКонтактнаяИнформация.Представление <> """"
		|	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОтветственныеЛицаОрганизаций.Наименование КАК Наименование,
		|	ПРЕДСТАВЛЕНИЕ(ОтветственныеЛицаОрганизаций.ФизическоеЛицо) КАК ФИО
		|ИЗ
		|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
		|ГДЕ
		|	(ОтветственныеЛицаОрганизаций.ДатаОкончания > &ТекущаяДата
		|			ИЛИ ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И ОтветственныеЛицаОрганизаций.Владелец В
		|			(ВЫБРАТЬ
		|				ВТОсновная.Организация
		|			ИЗ
		|				ВТОсновная)
		|	И ОтветственныеЛицаОрганизаций.ПометкаУдаления = ЛОЖЬ
		|	И ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
		|	И ОтветственныеЛицаОрганизаций.Должность = &Должность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТОсновная.Ссылка КАК Ссылка,
		|	ВТОсновная.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТОсновная.ФизическоеЛицоПредставление КАК ФизическоеЛицоПредставление,
		|	ВТОсновная.ДатаРожденияФизЛица КАК ДатаРожденияФизЛица,
		|	ВТОсновная.ФизЛицоСерия КАК ФизЛицоСерия,
		|	ВТОсновная.ФизЛицоНомер КАК ФизЛицоНомер,
		|	ВТОсновная.ФизЛицоДатаВыдачи КАК ФизЛицоДатаВыдачи,
		|	ВТОсновная.ФизЛицоКемВыдан КАК ФизЛицоКемВыдан,
		|	ВТОсновная.ФизЛицоКодПодразделения КАК ФизЛицоКодПодразделения,
		|	ВТОсновная.ПартнерНаименованиеПолное КАК ПартнерНаименованиеПолное,
		|	ВТОсновная.ПартнерПредставление КАК ПартнерПредставление,
		|	ВТОсновная.Контрагент КАК Контрагент,
		|	ВТОсновная.ИННКонтрагенты КАК ИННКонтрагенты,
		|	ВТОсновная.Организация КАК Организация,
		|	ВТОсновная.РабочееНаименованиеОрганизации КАК РабочееНаименованиеОрганизации,
		|	ВТОсновная.ПолноеНаименованиеОрганизации КАК ПолноеНаименованиеОрганизации,
		|	ВТОсновная.СокращенноеНаименованиеОрганизации КАК СокращенноеНаименованиеОрганизации,
		|	ВТОсновная.ИННОрганизации КАК ИННОрганизации,
		|	ВТОсновная.КППОрганизации КАК КППОрганизации,
		|	ВТОсновная.ОГРНОрганизации КАК ОГРНОрганизации,
		|	ВТОсновная.ФизЛицоПартнера КАК ФизЛицоПартнера,
		|	ВТОсновная.ФизЛицоПартнераПредставление КАК ФизЛицоПартнераПредставление,
		|	ВТОсновная.ФизЛицоПартнераДатаРождения КАК ФизЛицоПартнераДатаРождения,
		|	ВТОсновная.ФизЛицоПартнераСерия КАК ФизЛицоПартнераСерия,
		|	ВТОсновная.ФизЛицоПартнераНомер КАК ФизЛицоПартнераНомер,
		|	ВТОсновная.ФизЛицоПартнераДатаВыдачи КАК ФизЛицоПартнераДатаВыдачи,
		|	ВТОсновная.ФизЛицоПартнераКемВыдан КАК ФизЛицоПартнераКемВыдан,
		|	ВТОсновная.ФизЛицоПартнераКодПодразделения КАК ФизЛицоПартнераКодПодразделения,
		|	ВТОсновная.ОГРН КАК ОГРН,
		|	ЕстьNull(ВТОсновная.НаименованиеОсновногоБанковскогоСчета, 0) КАК НаименованиеОсновногоБанковскогоСчета,
		|	ЕстьNull(ВТОсновная.НаименованиеОсновногоБанковскогоСчетаГород, 0) КАК НаименованиеОсновногоБанковскогоСчетаГород,
		|	ВТОсновная.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТОсновная.КоррСчет КАК КоррСчет,
		|	ВТОсновная.БИК КАК БИК
		|ИЗ
		|	ВТОсновная КАК ВТОсновная";
		
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ТекущаяДата", Данные.ТекущаяДата);
	
	Если Сотрудник.Организация = АльтерраОбщегоНазначения.ПолучитьАльтерра() Тогда
		Запрос.УстановитьПараметр("Должность", "управляющий-ИП");
		Запрос.Текст = ЗапросТекст;
	Иначе
		Запрос.Текст = СтрЗаменить(ЗапросТекст, "И ОтветственныеЛицаОрганизаций.Должность = &Должность", "");
	КонецЕсли;
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет(); 
	
	ПромежуточныйРезультат = РезультатыЗапросов[3].Выбрать();
	Если ПромежуточныйРезультат.Следующий() Тогда
		Данные.Вставить("EMailФизическиеЛица", ПромежуточныйРезультат.Представление);
	КонецЕсли;
	                                            
	ПромежуточныйРезультат = РезультатыЗапросов[4].Выбрать();
	Если ПромежуточныйРезультат.Следующий() Тогда
		Данные.Вставить("ТелефонМобильныйФизическиеЛица", ПромежуточныйРезультат.Представление);
	КонецЕсли;
	
	ПромежуточныйРезультат = РезультатыЗапросов[5].Выбрать();
	Если ПромежуточныйРезультат.Следующий() Тогда
		Данные.Вставить("АдресПоПропискеФизическиеЛица", ПромежуточныйРезультат.Представление);
	КонецЕсли;
	
	ПромежуточныйРезультат = РезультатыЗапросов[6].Выбрать();
	Если ПромежуточныйРезультат.Следующий() Тогда
		Данные.Вставить("ФаксОрганизации", ПромежуточныйРезультат.Представление);
	КонецЕсли;
	
	ПромежуточныйРезультат = РезультатыЗапросов[7].Выбрать();
	Если ПромежуточныйРезультат.Следующий() Тогда
		Данные.Вставить("EmailОрганизации", ПромежуточныйРезультат.Представление);
	КонецЕсли;
	
	ПромежуточныйРезультат = РезультатыЗапросов[8].Выбрать();
	Если ПромежуточныйРезультат.Следующий() Тогда
		Данные.Вставить("ЮрАдресОрганизации", ПромежуточныйРезультат.Представление);
	КонецЕсли;
	
	ПромежуточныйРезультат = РезультатыЗапросов[9].Выбрать();
	Если ПромежуточныйРезультат.Следующий() Тогда
		Данные.Вставить("ПочтовыйАдресОрганизации", ПромежуточныйРезультат.Представление);
	КонецЕсли;
	
	ПромежуточныйРезультат = РезультатыЗапросов[10].Выбрать();
	Если ПромежуточныйРезультат.Следующий() Тогда
		Данные.Вставить("ЮрАдресКонтрагента", ПромежуточныйРезультат.Представление);
	КонецЕсли;
	
	ПромежуточныйРезультат = РезультатыЗапросов[11].Выбрать();
	Если ПромежуточныйРезультат.Следующий() Тогда
		Данные.Вставить("АдресПоПропискеФизическиеЛицаПартнер", ПромежуточныйРезультат.Представление);
	КонецЕсли;
	
	ПромежуточныйРезультат = РезультатыЗапросов[12].Выбрать();
	Если ПромежуточныйРезультат.Следующий() Тогда
		РуководительОрганизации = ПромежуточныйРезультат.ФИО;
		Данные.Вставить("РуководительОрганизацииРод", СклонениеПредставленийОбъектов.ПросклонятьФИО(РуководительОрганизации, 2));
		Данные.Вставить("РуководительОрганизации", РуководительОрганизации);
		Данные.Вставить("РуководительОрганизацииИнициалы", ПромежуточныйРезультат.Наименование);
	КонецЕсли;
	
	ПромежуточныйРезультат = РезультатыЗапросов[13].Выбрать();
	Если ПромежуточныйРезультат.Следующий() Тогда
		Данные.Вставить("ИнициалыФизЛица", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ПромежуточныйРезультат.ФизическоеЛицо));
		
		ФизическоеЛицоПредставление = ПромежуточныйРезультат.ФизическоеЛицоПредставление;
		Данные.Вставить("ФизическоеЛицоПредставление", ФизическоеЛицоПредставление);
		Данные.Вставить("ФизическоеЛицоПредставлениеРод", СклонениеПредставленийОбъектов.ПросклонятьФИО(ФизическоеЛицоПредставление, 3));
		
		Данные.Вставить("ДатаРожденияФизЛица", Формат(ПромежуточныйРезультат.ДатаРожденияФизЛица, "ДФ=dd.MM.yyyy"));
		Данные.Вставить("ФизЛицоСерия", ПромежуточныйРезультат.ФизЛицоСерия);
		Данные.Вставить("ФизЛицоНомер", ПромежуточныйРезультат.ФизЛицоНомер);
		Данные.Вставить("ФизЛицоДатаВыдачи", ПромежуточныйРезультат.ФизЛицоДатаВыдачи);
		Данные.Вставить("ФизЛицоКемВыдан", ПромежуточныйРезультат.ФизЛицоКемВыдан);
		Данные.Вставить("ФизЛицоКодПодразделения", ПромежуточныйРезультат.ФизЛицоКодПодразделения);
		Данные.Вставить("ПартнерНаименованиеПолное", ПромежуточныйРезультат.ПартнерНаименованиеПолное);
		
		ПартнерПредставление = ПромежуточныйРезультат.ПартнерПредставление;
		ПартнерПредставлениеБезИП = СокрЛП(СтрЗаменить(ПартнерПредставление, "ИП", ""));
		Данные.Вставить("ПартнерПредставлениеБезИП", ПартнерПредставлениеБезИП);
		Данные.Вставить("ИППлюсФИОПартнера", "ИП " + ПартнерПредставлениеБезИП);
		Данные.Вставить("ПартнерИППлюсИнициалы", "ИП " + ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ПартнерПредставлениеБезИП));
		
		Данные.Вставить("ПартнерПредставление", ПартнерПредставление);
		Данные.Вставить("Контрагент", ПромежуточныйРезультат.Контрагент);
		Данные.Вставить("ИННКонтрагенты", ПромежуточныйРезультат.ИННКонтрагенты);
		Данные.Вставить("Организация", ПромежуточныйРезультат.Организация);
				
		ПолноеНаименованиеОрганизации = ПромежуточныйРезультат.ПолноеНаименованиеОрганизации;
		Запрос.Текст = СтрЗаменить(ПолноеНаименованиеОрганизации, "ООО", "Общество с ограниченной ответственностью");
		Данные.Вставить("ПолноеНаименованиеОрганизации", ПолноеНаименованиеОрганизации);	
		
		Данные.Вставить("СокращенноеНаименованиеОрганизации", ПромежуточныйРезультат.СокращенноеНаименованиеОрганизации);
		
		Данные.Вставить("ИННОрганизации", ПромежуточныйРезультат.ИННОрганизации);
		Данные.Вставить("КППОрганизации", ПромежуточныйРезультат.КППОрганизации);
		Данные.Вставить("ОГРНОрганизации", ПромежуточныйРезультат.ОГРНОрганизации);
		
		Данные.Вставить("ФизЛицоПартнера", ПромежуточныйРезультат.ФизЛицоПартнера);
		Данные.Вставить("ФизЛицоПартнераПредставление", ПромежуточныйРезультат.ФизЛицоПартнераПредставление);
		Данные.Вставить("ФизЛицоПартнераДатаРождения", Формат(ПромежуточныйРезультат.ФизЛицоПартнераДатаРождения, "ДФ=dd.MM.yyyy"));
		Данные.Вставить("ФизЛицоПартнераСерия", ПромежуточныйРезультат.ФизЛицоПартнераСерия);
		Данные.Вставить("ФизЛицоПартнераНомер", ПромежуточныйРезультат.ФизЛицоПартнераНомер);
		Данные.Вставить("ФизЛицоПартнераДатаВыдачи", ПромежуточныйРезультат.ФизЛицоПартнераДатаВыдачи);
		Данные.Вставить("ФизЛицоПартнераКемВыдан", ПромежуточныйРезультат.ФизЛицоПартнераКемВыдан);
		Данные.Вставить("ФизЛицоПартнераКодПодразделения", ПромежуточныйРезультат.ФизЛицоПартнераКодПодразделения);
		
		Данные.Вставить("ОГРН", ПромежуточныйРезультат.ОГРН);
			
		Данные.Вставить("НаименованиеОсновногоБанковскогоСчета", 
			ПромежуточныйРезультат.НаименованиеОсновногоБанковскогоСчета + 
			" " +
			ВРег(ПромежуточныйРезультат.НаименованиеОсновногоБанковскогоСчетаГород));
			
		Данные.Вставить("РасчетныйСчет", ПромежуточныйРезультат.РасчетныйСчет);
		Данные.Вставить("КоррСчет", ПромежуточныйРезультат.КоррСчет);
		Данные.Вставить("БИК", ПромежуточныйРезультат.БИК);		
	КонецЕсли;

	Возврат Данные; 
КонецФункции      

&НаСервереБезКонтекста
Функция ИнициализацияСтруктуры()	
	Данные = Новый Структура;
	Данные.Вставить("EMailФизическиеЛица", "");
	Данные.Вставить("ТелефонМобильныйФизическиеЛица", "");		
	Данные.Вставить("АдресПоПропискеФизическиеЛица", "");
	Данные.Вставить("ФаксОрганизации", "");
	Данные.Вставить("EmailОрганизации", "");
	Данные.Вставить("ЮрАдресОрганизации", "");
	Данные.Вставить("ПочтовыйАдресОрганизации", "");
	Данные.Вставить("ЮрАдресКонтрагента", "");
	Данные.Вставить("АдресПоПропискеФизическиеЛица", "");
	Данные.Вставить("РуководительОрганизацииРод", "");
	Данные.Вставить("РуководительОрганизации", "");
	Данные.Вставить("РуководительОрганизацииИнициалы", "");
	Данные.Вставить("ИнициалыФизЛица", "");	
	Данные.Вставить("ФизическоеЛицоПредставление", "");
	Данные.Вставить("ФизическоеЛицоПредставлениеРод", "");
	Данные.Вставить("ДатаРожденияФизЛица", "");
	Данные.Вставить("ФизЛицоСерия", "");
	Данные.Вставить("ФизЛицоНомер", "");
	Данные.Вставить("ФизЛицоДатаВыдачи", "");
	Данные.Вставить("ФизЛицоКемВыдан", "");
	Данные.Вставить("ФизЛицоКодПодразделения", "");
	Данные.Вставить("ПартнерНаименованиеПолное", "");
	Данные.Вставить("ПартнерПредставлениеБезИП", "");
	Данные.Вставить("ПартнерИППлюсИнициалы", "");
	Данные.Вставить("ПартнерПредставление", "");
	Данные.Вставить("Контрагент", "");
	Данные.Вставить("ИННКонтрагенты", "");
	Данные.Вставить("Организация", "");
	Данные.Вставить("РабочееНаименованиеОрганизации", "");
	Данные.Вставить("ПолноеНаименованиеОрганизации", "");
	Данные.Вставить("СокращенноеНаименованиеОрганизации", "");
	Данные.Вставить("ИННОрганизации", "");
	Данные.Вставить("КППОрганизации", "");
	Данные.Вставить("ОГРНОрганизации", "");
	Данные.Вставить("ФизЛицоПартнера", "");
	Данные.Вставить("ФизЛицоПартнераПредставление", "");
	Данные.Вставить("ФизЛицоПартнераДатаРождения", "");
	Данные.Вставить("ФизЛицоПартнераСерия", "");
	Данные.Вставить("ФизЛицоПартнераНомер", "");
	Данные.Вставить("ФизЛицоПартнераДатаВыдачи", "");
	Данные.Вставить("ФизЛицоПартнераКемВыдан", "");
	Данные.Вставить("ФизЛицоПартнераКодПодразделения", "");
	Данные.Вставить("ОГРН", "");
	Данные.Вставить("НаименованиеОсновногоБанковскогоСчета", "");
	Данные.Вставить("РасчетныйСчет", "");
	Данные.Вставить("КоррСчет", "");
	Данные.Вставить("БИК", "");		
	
	ТекущаяДата = ТекущаяДата();
	
	Данные.Вставить("ТекущаяДата", ТекущаяДата);
	Данные.Вставить("ТекущаяДатаФормат", Формат(ТекущаяДата, "ДЛФ=ДД"));
	Данные.Вставить("ДатаПлюсДваГода", Формат(Дата(Год(ТекущаяДата) + 2, Месяц(ТекущаяДата), День(ТекущаяДата)), "ДФ=dd.MM.yyyy"));

	ДатаПрописью = АльтерраОбщегоНазначения.ДатаПрописью(ТекущаяДата);
	ДатаПрописью = ВРег(Лев(ДатаПрописью, 1)) + Сред(ДатаПрописью, 2);
	Данные.Вставить("ДатаПрописью", ДатаПрописью);

	Возврат Данные;
КонецФункции



//БЕЙДЖЫ ВОДИТЕЛЕЙ
&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ОтображениеБейджейВодителя(); 
КонецПроцедуры

&НаКлиенте                                                    
Процедура ОтображениеБейджейВодителя()
	Если Объект.Водитель Тогда 
		Элементы.КнопкиБейджей.ТолькоПросмотр = Ложь;
		Элементы.ГруппаБейджиВодителей.ТолькоПросмотр = Ложь;
	Иначе 
		Элементы.КнопкиБейджей.ТолькоПросмотр = Истина;
		Элементы.ГруппаБейджиВодителей.ТолькоПросмотр = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьШтрихкод(Команда) 
	Для каждого Строка из Объект.БейджыВодителя Цикл 
		Если Строка.Штрихкод = "" или Строка.Штрихкод = Неопределено Тогда 
			Строка.Штрихкод = ПолучитьШтрихкод(Строка.НомерСтроки); 
			Строка.Наименование = Объект.Наименование + " " + Строка.ТранспортноеСредство;
		КонецЕсли;  
	КонецЦикла;  
	
КонецПроцедуры  
	
	
&НаСервере 
Функция ПолучитьШтрихкод(НомерСтроки) 
	QRкод = "9999"; 
	ВременнаяСтрока = Прав(Объект.Код, 8); 
	Если НомерСтроки < 10 Тогда 
		QRкод = "9999" + ВременнаяСтрока + "0" + Строка(НомерСтроки); 
	Иначе 
	   QRкод = "9999" + ВременнаяСтрока + Строка(НомерСтроки);
   КонецЕсли; 
  	Возврат QRкод; 
КонецФункции 

&НаКлиенте
Процедура БейджыВодителяПередУдалением(Элемент, Отказ)
	Если не Элементы.БейджыВодителя.ТекущиеДанные.Штрихкод = "" Тогда
		Если Не ЭтоВсевышний() Тогда
			Сообщить("Запрещено удалять строки со сформированным штрихкодом"); 
			Отказ = Истина;  
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаСервере 
Функция ЭтоВсевышний()
	Возврат РольДоступна("ПолныеПрава"); 
КонецФункции
